<template>
  <div>
    <h2>{{name}}规则说明</h2>
    <slot name="describe"></slot>
    <ul>
      <li>以下所有投注皆含本金。</li>
    </ul>
    <ul>
      <li>
        <span class="label">1.特码</span>
      </li>
      <li class="stress">{{name}}公司当期开出的最後一码为特码。</li>
    </ul>
    <ul>
      <li>
        <span class="label">2.两面</span>
      </li>
      <li>
        <span class="label">特码大小</span>
      </li>
      <li class="stress">特小：开出的特码，(01~24)小于或等于24。</li>
      <li class="stress">特大：开出的特码，(25~48)小于或等于48。</li>
      <li class="stress">和局：特码为49时。</li>

      <li>
        <span class="label">特码单双</span>
      </li>
      <li class="stress">特双：特码为双数，如18、20、34、42。</li>
      <li class="stress">特单：特码为单数，如01，11，35，47。</li>
      <li class="stress">和局：特码为49时。</li>

      <li>
        <span class="label">特码合数大小</span>
      </li>
      <li class="stress">特合大：以特码的个位和十位数字之和来判定胜负，介于7-12为合大。例如：07、34、48。</li>
      <li class="stress">特合小：以特码的个位和十位数字之和来判定胜负，介于1-6为合小。例如：01、24、33。</li>
      <li class="stress">和局：特码为49时。</li>

      <li>
        <span class="label">特码合数单双</span>
      </li>
      <li class="stress">特合双：指开出特码的个位加上十位之和为‘双数’，如02、11、33、44。</li>
      <li class="stress">特合单：指开出特码的个位加上十位之和为‘单数’，如01、14、36、47。</li>
      <li class="stress">和局：特码为49时。</li>

      <li>
        <span class="label">特码：特天肖，特地肖</span>
      </li>
      <li class="stress">开出的特码属于十二生肖中的牛、兔、龙、马、猴、猪号码为特天肖。</li>
      <li class="stress">开出的特码属于十二生肖中的鼠、虎、蛇、羊、鸡、狗号码为特地肖。</li>
      <li class="stress">开出49则视为和局。</li>

      <li>
        <span class="label">特码：特前肖，特后肖</span>
      </li>
      <li class="stress">开出的特码属于十二生肖中的鼠、牛、虎、兔、龙、蛇号码为特前肖。</li>
      <li class="stress">开出的特码属于十二生肖中的马、羊、猴、鸡、狗、猪号码为特后肖。</li>
      <li class="stress">开出49则视为和局。</li>

      <li>
        <span class="label">特码：特家肖，特野肖</span>
      </li>
      <li class="stress">开出的特码属于十二生肖中的牛、马、羊、鸡、狗、猪号码为家禽。</li>
      <li class="stress">开出的特码属于十二生肖中的鼠、虎、龙、蛇、兔、猴号码为野兽。</li>
      <li class="stress">开出49则视为和局。</li>

      <li>
        <span class="label">特码尾数大小</span>
      </li>
      <li class="stress">特大尾：5尾~9尾为大，如05、18、19。</li>
      <li class="stress">特小尾：0尾~4尾为小，如01、32、44。</li>
      <li class="stress">和局：特码为49时。</li>

      <li>
        <span class="label">总和单双</span>
      </li>
      <li class="stress">总和单：所以七个开奖号码的分数总和是‘单数’，如分数总和是133、197。</li>
      <li class="stress">总和双：所以七个开奖号码的分数总和是‘双数’，如分数总和是120、188。</li>

      <li>
        <span class="label">总和大小</span>
      </li>
      <li class="stress">总和大：所以七个开奖号码的分数总和大于或等于175。</li>
      <li class="stress">总和小：所以七个开奖号码的分数总和小于或等于174。</li>

      <li>
        <span class="label">特码半特</span>
      </li>
      <li class="stress">以特码大小与特码单双游戏为一个投注组合；当期特码开出符合投注组合，即视为中奖；若当期特码开出49号，其余情形视为不中奖。</li>
      <li class="stress">特大单：25、27、29、31、33、35、37、39、41、43、45、47。</li>
      <li class="stress">特大双：26、28、30、32、34、36、38、40、42、44、46、48。</li>
      <li class="stress">特小单：01、03、05、07、09、11、13、15、17、19、21、23。</li>
      <li class="stress">特小双：02、04、06、08、10、12、14、16、18、20、22、24。</li>
      <li class="stress">和局：特码为49时。</li>
    </ul>
    <ul>
      <li>
        <span class="label">3.色波半波</span>
      </li>
      <li class="stress">{{name}}49个号码球分别有红、蓝、绿三种颜色，以特码开出的颜色和投注的颜色相同视为中奖，颜色代表如下:</li>
      <li class="stress">红波：01 ,02 ,07 ,08 ,12 ,13 ,18 ,19 ,23 ,24 ,29 ,30 ,34 ,35 ,40 ,45 ,46</li>
      <li class="stress">蓝波：03 ,04 ,09 ,10 ,14 ,15 ,20 ,25 ,26 ,31 ,36 ,37 ,41 ,42 ,47 ,48</li>
      <li class="stress">绿波：05 ,06 ,11 ,16 ,17 ,21 ,22 ,27 ,28 ,32 ,33 ,38 ,39 ,43 ,44 ,49</li>
      <li class="stress">
        半波：以特码色波和红单，红双，红大，红小，蓝单，蓝双，蓝大，蓝小，绿单，绿双，绿大，绿小为一个投注组合，当期特码开出符合投注组合，即视为中奖；若当期特码开出49号则视为和局；其余情形视为不中奖。
        半半波：以特码色波和红大单，红大双，红小单，红小双，蓝大单，蓝大双，蓝小单，蓝小双，绿大单，绿大双，绿小单，绿小双为一个投注组合，当期特码开出符合投注组合，即视为中奖；若当期特码开出49号则视为和局；其余情形视为不中奖。
      </li>
    </ul>
    <ul>
      <li>
        <span class="label">4.特肖头尾数</span>
      </li>
      <li>
        <span class="label">特码生肖</span>
      </li>
      <li class="stress">生肖顺序为 鼠 >牛 >虎 >兔 >龙 >蛇 >马 >羊 >猴 >鸡 >狗 >猪 。</li>
      <li class="stress">如今年是猪年，就以猪为开始，依顺序将49个号码分为12个生肖『如下』</li>
      <li class="stress">猪: 01、13、25、37、49</li>
      <li class="stress">狗: 02、14、26、38</li>
      <li class="stress">鸡: 03、15、27、39</li>
      <li class="stress">猴: 04、16、28、40</li>
      <li class="stress">羊: 05、17、29、41</li>
      <li class="stress">马: 06、18、30、42</li>
      <li class="stress">蛇: 07、19、31、43</li>
      <li class="stress">龙: 08、20、32、44</li>
      <li class="stress">兔: 09、21、33、45</li>
      <li class="stress">虎: 10、22、34、46</li>
      <li class="stress">牛: 11、23、35、47</li>
      <li class="stress">鼠: 12、24、36、48</li>
      <li class="stress">若当期特别号，落在下注生肖范围内，视为中奖 。</li>

      <li>
        <span class="label">特码头数：是指特码属头数的号码</span>
      </li>
      <li class="stress">"0"头：01、02、03、04、05、06、07、08、09</li>
      <li class="stress">"1"头：10、11、12、13、14、15、16、17、18、19</li>
      <li class="stress">"2"头：20、21、22、23、24、25、26、27、28、29</li>
      <li class="stress">"3"头：30、31、32、33、34、35、36、37、38、39</li>
      <li class="stress">"4"头：40、41、42、43、44、45、46、47、48、49</li>
      <li class="stress">例如：开奖结果特别号码为21则2头为中奖，其他头数都不中。</li>

      <li>
        <span class="label">特码尾数：是指特码属尾数的号码。</span>
      </li>
      <li class="stress">"0"尾：10、20、30、40</li>
      <li class="stress">"1"尾：01、11、21、31、41</li>
      <li class="stress">"2"尾：02、12、22、32、42</li>
      <li class="stress">"3"尾：03、13、23、33、43</li>
      <li class="stress">"4"尾：04、14、24、34、44</li>
      <li class="stress">"5"尾：05、15、25、35、45</li>
      <li class="stress">"6"尾：06、16、26、36、46</li>
      <li class="stress">"7"尾：07、17、27、37、47</li>
      <li class="stress">"8"尾：08、18、28、38、48</li>
      <li class="stress">"9"尾：09、19、29、39、49</li>
      <li class="stress">例如：开奖结果特别号码为21则1尾数为中奖，其他尾数都不中奖。</li>
    </ul>

    <ul>
      <li>
        <span class="label">5.合肖</span>
      </li>
      <li
        class="stress"
      >挑选2-11个生肖『排列如同生肖』为一个组合，并选择开奖号码的特码是否在此组合内『49号除外』，即视为中奖；若当期特码开出49号，则所有组合皆视为和局。</li>
    </ul>

    <ul>
      <li>
        <span class="label">6.正码</span>
      </li>
      <li
        class="stress"
      >{{name}}公司当期开出之前6个号码叫正码。每一个号码为一投注组合，假如投注号码为开奖号码之正码，视为中奖，其余情形视为不中奖。</li>
    </ul>

    <ul>
      <li>
        <span class="label">7.正码特</span>
      </li>
      <li class="stress">正码特是指 正1特、正2特、正3特、正4特、正5特、正6特。</li>
      <li class="stress">其下注的正码特号与现场摇珠开出之正码其开奖顺序及开奖号码相同，视为中奖。</li>
      <li class="stress">如现场摇珠第一个正码开奖为49号，下注第一个正码特为49则视为中奖，其它号码视为不中奖。</li>
    </ul>

    <ul>
      <li>
        <span class="label">8.正码1-6</span>
      </li>
      <li
        class="stress"
      >{{name}}公司当期开出之前6个号码叫正码。第一时间出来的叫正码1，依次为正码2、正码3┅┅ 正码6(并不以号码大小排序)。</li>
      <li class="stress">大小:以指定出现正码的位置与号码大于或等于25为大，小于或等于24为小，开出49为和。</li>
      <li class="stress">单双:以指定出现正码的位置与号码为单数或双数下注，开出49为和</li>
      <li class="stress">合数大小:以指定出现正码的位置与号码个位和十位数字总和来判断胜负，和数大于或等于7为大，小于或等于6为小，开出49号为和。</li>
      <li class="stress">合数单双:以指定出现正码的位置与号码个位和十位数字总和来判断单双，开出49号为和。</li>
      <li
        class="stress"
      >尾数大小:以指定出现正码的位置与号码尾数大小下注，若0尾~4尾为小、5尾~9尾为大。如01、32、44为正尾小；如05、18、19为正尾大，开出49号为和。</li>
      <li class="stress">色波:以指定出现正码的位置的球色下注，开奖之球色与下注之颜色相同时，视为中奖，其余情形视为不中奖。</li>
    </ul>

    <ul>
      <li>
        <span class="label">9.五行</span>
      </li>
      <li class="stress">挑选一个五行选项为一个组合，若开奖号码的特码在此组合内，即视为中奖；若开奖号码的特码亦不在此组合内，即视为不中奖；</li>
      <li class="stress">金: 05、06、19、20、27、28、35、36、49</li>
      <li class="stress">木: 01、02、09、10、17、18、31、32、39、40、47、48</li>
      <li class="stress">水: 07、08、15、16、23、24、37、38、45、46</li>
      <li class="stress">火: 03、04、11、12、25、26、33、34、41、42</li>
      <li class="stress">土: 13、14、21、22、29、30、43、44</li>
    </ul>

    <ul>
      <li>
        <span class="label">10.一肖总肖平特尾数</span>
      </li>
      <li>
        <span class="label">一肖</span>
      </li>
      <li class="stress">指开奖的7个号码中含有所属生肖的一个或多个号码，但派彩只派一次，即不论同生肖号码出现一个或多个号码都只派一次。</li>
      <li class="stress">猪: 01、13、25、37、49</li>
      <li class="stress">狗: 02、14、26、38</li>
      <li class="stress">鸡: 03、15、27、39</li>
      <li class="stress">猴: 04、16、28、40</li>
      <li class="stress">羊: 05、17、29、41</li>
      <li class="stress">马: 06、18、30、42</li>
      <li class="stress">蛇: 07、19、31、43</li>
      <li class="stress">龙: 08、20、32、44</li>
      <li class="stress">兔: 09、21、33、45</li>
      <li class="stress">虎: 10、22、34、46</li>
      <li class="stress">牛: 11、23、35、47</li>
      <li class="stress">鼠: 12、24、36、48</li>
      <li class="stress">只要当期号码 (所有正码与最后开出的特码)，落在下注生肖范围内，则视为中奖。(请注意：49亦算输赢，不为和)。</li>

      <li>
        <span class="label">尾数</span>
      </li>
      <li class="stress">指开奖的7个号码中含有所属尾数的一个或多个号码，但派彩指派一次，即不论同尾数号码出现一个或多个号码都指派一次。</li>
      <li class="stress">"0"尾：10、20、30、40</li>
      <li class="stress">"1"尾：01、11、21、31、41</li>
      <li class="stress">"2"尾：02、12、22、32、42</li>
      <li class="stress">"3"尾：03、13、23、33、43</li>
      <li class="stress">"4"尾：04、14、24、34、44</li>
      <li class="stress">"5"尾：05、15、25、35、45</li>
      <li class="stress">"6"尾：06、16、26、36、46</li>
      <li class="stress">"7"尾：07、17、27、37、47</li>
      <li class="stress">"8"尾：08、18、28、38、48</li>
      <li class="stress">"9"尾：09、19、29、39、49</li>
      <li class="stress">例如：开奖结果正码号码为11、31、42、44、35、32特别号码为21则1尾2尾4尾5尾都为中奖，其他尾数都不中奖。</li>

      <li>
        <span class="label">总肖</span>
      </li>
      <li class="stress">
        当期号码(所有正码与最後开出的特码)开出的不同生肖总数，与所投注之预计开出之生肖总数合(不用指定特定生肖)，则视为中奖，其余情形视为不中奖。例如：如果当期号码为19、24、12、34、40、39
        特别号：49，总计六个生肖，若选总肖【6】则为中奖(请注意：49号亦算输赢，不为和）。
      </li>
    </ul>

    <ul>
      <li>
        <span class="label">11.正肖七色波</span>
      </li>
      <li>
        <span class="label">正肖</span>
      </li>
      <li
        class="stress"
      >以开出的6个正码做游戏，只要有1个落在下注生肖范围内，视为中奖。如超过1个正码落在下注生肖范围内 ，派彩将倍增！如：下注＄100.-正肖當年生肖倍率1.8。</li>
      <li class="stress">6个正码开出01，派彩为$80</li>
      <li class="stress">6个正码开出01、13，派彩为$160</li>
      <li class="stress">6个正码开出01、13、25，派彩为$240</li>
      <li class="stress">6个正码开出01、13、25、37，派彩为$320</li>
      <li class="stress">6个正码开出01、13、25、37、49，派彩为$400（请注意：49亦算输赢，不为和）</li>

      <li>
        <span class="label">七色波</span>
      </li>
      <li class="stress">以开出的7个色波，那种颜色最多为中奖。 开出的6个正码各以1个色波计，特别号以1.5个色波计。而以下3种结果视为和局。</li>
      <li class="stress">1： 6个正码开出3蓝3绿，而特别码是1.5红</li>
      <li class="stress">2： 6个正码开出3蓝3红，而特别码是1.5绿</li>
      <li class="stress">3： 6个正码开出3绿3红，而特别码是1.5蓝</li>
      <li class="stress">如果出现和局，所有投注红，绿，蓝七色波的金额将全数退回，会员也可投注和局</li>
    </ul>

    <ul>
      <li>
        <span class="label">12.自选不中</span>
      </li>
      <li
        class="stress"
      >挑选5~12个号码为一个组合，当期号码 (所有正码与最后开出的特码) 皆没有坐落于投注时所挑选之号码组合内，则视为中奖，若是有任何一个当期号码开在所挑选的号码组合情形视为不中奖。</li>
      <li class="stress">例如当期号码为19、24、17、34、40、39 ,特别号49，所挑选5个号码，若所挑选的号码内皆没有坐落于当期号码，则为中奖。</li>
    </ul>

    <ul>
      <li>
        <span class="label">13.连肖连尾</span>
      </li>
      <li
        class="stress"
      >连肖:生肖所对应的号码和特码生肖项目的一样；一个生肖对应多个号码，不论同生肖的号码出现一个或多个，派彩只派一次。每个生肖都有自己的赔率，下注组合的总赔率，取该组合生肖的最低赔率为总赔率。（请注意49亦算输赢）。</li>
      <li class="stress">
        二连肖:以每二个生肖为一注，每注的每个生肖中如果都有当期开奖的所有7个号码中对应的生肖，则视为中奖。如果其中一个或多个生肖没有当期开奖的所有7个号码对应的生肖，则视为不中奖。例如生肖：蛇，马，是一注，开奖的
        生肖是：马，牛，羊，鸡，狗，猪，鼠，那就是不中奖；再例如生肖：蛇，马，是一注，开奖的生肖是：蛇，马，牛，羊，鸡，狗，猪，那就是中奖。
      </li>
      <li
        class="stress"
      >三连肖:以每三个生肖为一注，每注的每个生肖中如果都有当期开奖的所有7个号码中对应的生肖，则视为中奖。如果其中一个或多个生肖没有当期开奖的所有7个号码对应的生肖，则视为不中奖。例如生肖：蛇，马，牛，是一注，开奖的生肖是：马，牛，羊，鸡，狗，猪，鼠，那就是不中奖；再例如生肖：蛇，马，牛，是一注，开奖的生肖是：蛇，马，牛，羊，鸡，狗，猪，那就是中奖。</li>
      <li class="stress">
        四连肖:以每四个生肖为一注，每注的每个生肖中如果都有当期开奖的所有7个号码中对应的生肖，则视为中奖。如果其中一个或多个生肖没有当期开奖的所有7个号码对应的生肖，则视为不中奖。例如生肖：蛇，马，牛，羊，是一注，开奖的生肖是：马，牛，羊，鸡，狗，猪，鼠，
        那就是不中奖；再例如生肖：蛇，马，牛，羊，是一注，开奖的生肖是：蛇，马，牛，羊，鸡，狗，猪，那就是中奖。
      </li>
      <li class="stress">
        五连肖:以每五个生肖为一注，每注的每个生肖中如果都有当期开奖的所有7个号码中对应的生肖，则视为中奖。如果其中一个或多个生肖没有当期开奖的所有7个号
        码对应的生肖，则视为不中奖。例如生肖：蛇，马，牛，羊，鸡，是一注，开奖的生肖是：马，牛，羊，鸡，狗，猪，那就是不中奖；再例如生肖：蛇，马，牛，羊，鸡，是一注，开奖的生肖是：蛇，马，牛，羊，鸡，狗，猪，那就是中奖。
      </li>
      <li
        class="stress"
      >连尾:尾数所对应的号码和尾数项目的一样；一个尾数对应多个号码，不论同尾数的号码出现一个或多个，派彩只派一次。每个尾数都有自己的赔率，下注组合的总赔率，取该组合尾数的最低赔率为总赔率。（请注意49亦算输赢）。</li>
      <li class="stress">
        二连尾:以每二个尾数为一注，每注的每个尾数中如果都有当期开奖的所有7个号码中对应的尾数，则视为中奖。如果其中一个或多个尾数没有当期开奖的所有7个号码对应的尾数，则视为不中奖。例如：尾1、尾2，是一注，开奖的号码是：2、3、4、5、6、7、8，那就是不中奖；再例如：尾1、尾2，是一注，开奖的号码是：1、2、3、4、5、
        6、7，那就是中奖。
      </li>
      <li
        class="stress"
      >三连尾:以每三个尾数为一注，每注的每个尾数中如果都有当期开奖的所有7个号码中对应的尾数，则视为中奖。如果其中一个或多个尾数没有当期开奖的所有7个号码对应的尾数，则视为不中奖。例如：尾1、尾2、尾3，是一注，开奖的号码是：2、3、4、5、6、7、8，那就是不中奖；再例如：尾1、尾2、尾3，是一注，开奖的号码是：1、2、3、4、5、6、7，那就是中奖。</li>
      <li class="stress">
        四连尾:以每四个尾数为一注，每注的每个尾数中如果都有当期开奖的所有7个号码中对应的尾数，则视为中奖。如果其中一个或多个尾数没有当期开奖的所有7个号码对应的尾数，则视为不中奖。例如：尾1、尾2、尾3、尾4，是一注，开奖的号码是：2、3、4、5、6、7、8，
        那就是不中奖；再例如：尾1、尾2、尾3、尾4，是一注，开奖的号码是：1、2、3、4、5、6、7，那就是中奖。
      </li>
      <li class="stress">
        五连尾:以每五个尾数为一注，每注的每个尾数中如果都有当期开奖的所有7个号码中对应的尾数，则视为中奖。如果其中一个或多个尾数没有当期开奖的所有7个号码对应的尾数，则视为不中奖。例如：尾1、尾2、尾3、尾4、尾5，是一注，开奖的号码是：2、3、4、5、6、7、8，
        那就是不中奖；再例如：尾1、尾2、尾3、尾4、尾5，是一注，开奖的号码是：1、2、3、4、5、6、7，那就是中奖。
      </li>
    </ul>

    <ul>
      <li>
        <span class="label">14.连码</span>
      </li>
      <li class="stress">四全中：选择投注号码每四个为一组（四个或四个以上），兑奖号为正码，如四个号码都在开奖号码的正码里面，视为中奖，其他情形都视为不中奖。</li>
      <li class="stress">
        三全中：所投注的每三个号码为一组合，若三个号码都是开奖号码之正码，视为中奖，其余情形视为 不中奖。如06、07、08三个都是开奖号码之正码，视为中奖，如两个正码加上一个特别号
        码视为不中奖 。
      </li>
      <li class="stress">
        三中二：所投注的每三个号码为一组合，若其中2个是开奖号码中的正码，即为三中二，视为中奖；若3个都是开奖号码中的正码，即为三中二之中三，其余情形视为不中奖，如06、07、08
        为一组合，开奖号码中有06、07两个正码，没有08，即为三中二，按三中二赔付；如开奖 号码中有06、07、08三个正码，即为三中二之中三，按中三赔付；如出现1个或没有，视为不中奖 。
      </li>
      <li class="stress">二全中：所投注的每二个号码为一组合，二个号码都是开奖号码之正码，视为中奖，其余情形视为不 中奖（含一个正码加一个特别号码之情形）。</li>
      <li
        class="stress"
      >二中特：所投注的每二个号码为一组合，二个号码都是开奖号码之正码，叫二中特之中二；若其中一 个是正码，一个是特别号码，叫二中特之中特；其余情形视为不中奖 。</li>
      <li class="stress">特串：所投注的每二个号码为一组合，其中一个是正码，一个是特别号码，视为中奖，其余情形视为不中奖（含二个号码都是正码之情形）。</li>
    </ul>
  </div>
</template>

<script>
export default {
  name: "hk6Rule",
  props:['name']
};
</script>


<style lang="scss" scoped>
.label {
  font-size: px2rem(26px);
  color: #ff5e5e;
  font-weight: 600;
}

li {
  list-style: none;
  margin-top: px2rem(16px);
  line-height: px2rem(40px);
}

.select {
  padding: px2rem(10px) 0 0 px2rem(30px);
}
</style>